while True:
    x = float(input("Введіть перше число: "))
    y = input("Введіть дію, яка буде виконуватися над цими числами (+, -, *, /): ")
    z = float(input("Введіть друге число: "))

    if y == "+":
        print("Результат: ", x + z)
    elif y == "-":
        print("Результат: ", x - z)
    elif y == "*":
        print("Результат: ", x * z)
    elif y == "/":
        if z == 0:
            print("Помилка: дільник не може дорівнювати нулю!")
        else:
            print("Результат: ", x / z)
    else:
        print("Помилка: перевірте данні і операцію!")

    contin = input("Чи бажаєте ви продовжити обчислення (y/yes для продовження, або просто нажміть enter для завершення): ").lower()
    if contin not in ("yes", "y"):
        print("Калькулятор завершив роботу.")
        break
